# SetCoverType Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarHostData..::..SetCoverType Method
RebarHostData Class See Also
---
Associates the specified CoverType with the specified face of the element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public void SetCoverType(
	Reference face,
	RebarCoverType coverType
)
```

Visual Basic
---
```text
Public Sub SetCoverType ( _
	face As Reference, _
	coverType As RebarCoverType _
)
```

Visual C++
---
```text
public:
void SetCoverType(
	Reference^ face,
	RebarCoverType^ coverType
)
```

# ### Parameters
face
    Type: Autodesk.Revit.DB..::..Reference
coverType
    Type: Autodesk.Revit.DB.Structure..::..RebarCoverType
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | In this element, face does not have an associated CoverType, because it is not exposed. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace